//программа определяет является ли число просты
 /*int main() {
 int a = 13, b;
  bool res;
  
  res = true; // true - простое число, false - не простое
  for (int i = 2; i < a; i++) //поскольку мы не можем начинать проверку с деления на 0 или 1 поскольку все числа делятся на 1 начинаем с 2
    {
    b = a % i;
    if (b == 0) { 
    res = false; break; }
  }
  return 0;
}*/
  
  
int main() {
  int a = 13, b;
  bool res = true; // true - простое число, false - не простое
  for (int i = 2; i < a; i++) //поскольку мы не можем начинать проверку с деления на 0 или 1 поскольку все числа делятся на 1 начинаем с 2
  {
    b = a % i;
    if (b == 0) { res = false; break; }
  }
}
  

